/*
***************************************************************
                    ОГЛАВЛЕНИЕ
ПЕРЕМЕННЫЕ + АРИФМЕТИКА..................................47;
    Запись в переменную..................................58;
    Вывод в консоль......................................64;
    Запись функции в переменную..........................70;
    Арифметика (формы, операции, дикрименты).............74;
    Библиотека Math......................................82;
МАССИВЫ (СТРУКТУРА ХРАНЕНИЯ ДАННЫХ)......................83;
    Инициализация массива................................97;
    Создание экземпляра класса "Массив".................101;
    Добавления в массив и вывод элемента................105;
ЦИКЛЫ...................................................112;
    Цикл for............................................119;
    Цикл с предусловием.................................124;
    Цикл с постусловием.................................131;
    Вывод массива с использолванием цикла...............138;
УСЛОВИЯ.................................................144;
    Условие выполнится..................................157;
    Условие не выполнится, пойдёт else if...............162;
    Условия с переменными...............................171;
    Работа с логикой....................................182;
    Оператор множественного выбора switch...............188;
ФУНКЦИИ.................................................206;
    Первая функция......................................212;
    Функция с параметрами и возвратом...................221;
ОБЪЕКТЫ.................................................228;
    Создание объекта с методом и ключевым словом this...233;
    Обращение к объекту и методу........................248;
    Конструктор создания объектов.......................254;
    Функция как конструктор объекта.....................264;
СОБЫТИЯ.................................................272;
    Функции и кнопки....................................278;
НЕБОЛЬШАЯ ПРАКТИКА (РАБОТА С ФОРМОЙ)....................285;

***************************************************************
*/

/*
    alert("") - вывод всплывающего сообщения в браузере";
    prompt("") - вывод диалогового окна;
    document.write - вывод на саму страничку;

    Math - библиотека математических операций;
    document. - обращение к объектам формы; 
*/

/////////////////////////////////////////////////////////////////////////////////////////
/*ПЕРЕМЕННЫЕ + АРИФМЕТИКА*/
/*
    -Переменные - ячейки для записи информации.
    -Имена переменных чуствительны к регистру.
    -В переменные можно записывать что угодно (язык не типизированный).

    -Инкрименты и дикрименты: ++, --;
    -Арифметические формы: +=, -=, *=, /=, %=;
    -Арифметические операции: +, -, *, /, %;
*/

// Запись в переменную num.
var num = 23.34;
var Num = 5;
var str = "Masha";
var bool = true;

// Вывод в консоль. Консоль в исходном коде страницы.
console.log(num);
console.log(Num);
console.log(str);
console.log(bool);

// Запись функции в переменную.
//var Name = prompt("Как Вас зовут?");
//console.log("Ваше имя: " + Name);

// Арифметика (формы, операции, дикрименты).
var FirstNum = 14;
var SecondNum = 34;
FirstNum = 12 + FirstNum;
FirstNum += 10;
FirstNum++;
document.write("Результат: ", FirstNum + SecondNum);

// Библиотека Math.
document.write("<br>" + "Число Pi: ", Math.ceil(Math.PI)); // Вывод const значения с тегом.
document.write("<br>", Math.floor(6.9)); // Округление к меньшему.
document.write("<br>", Math.round(2.7)); // Правильное округление.
document.write("<br>", Math.abs(-45)); // Модуль числа.
document.write("<br>", "<br>", "<br>", "<br>");

/////////////////////////////////////////////////////////////////////////////////////////
/*МАССИВЫ (СТРУКТУРА ДЛЯ ХРАНЕНИЯ ДАННЫХ)*/
/*
    -Массив - структура данных, которая содержит информацию;
    -Нумерация с нуля;
    -В массив можно записывать любые значения;
*/

// Инициализация массива.
var colors = [true, "Red", "Green", "Blue", 1.5, 23];
document.write(colors[0], "<br>");

// Создание экземпляра класса "Массив".
var colors2 = new Array("Green");
document.write(colors2[0], "<br>");

// Добавления в массив и вывод элемента.
colors2[1] = "Gray";
document.write(colors2[0] + colors2[1], "<br>");
colors2.push("Pink");
document.write(colors2[colors2.length - 1], "<br>");

/////////////////////////////////////////////////////////////////////////////////////////
/*ЦИКЛЫ*/
/*
    -Конструкции, которые позволяют многократно повторать действия;
    -Первый параметр - это счётчик, второй - условие выхода, третий действия (++, --, +=, ...);
    -Если 1 строчка кода, то фигурные скобки не нужны.
*/

// Цикл for.
for (var i = 0; i <= 10; i++) {
  console.log(i); // Вывод в консоль значений от 0 до 10 включительно;
}

// Цикл с предусловием.
var i = 0;
while (i <= 10) {
  console.log(i);
  i++;
}

// Цикл с постусловием. Он выполнится хотябы 1 раз.
i = 10;
do {
  console.log(i);
  i -= 2;
} while (i > 0);

// Вывод массива с использолванием цикла.
for (var i = 0; i < colors2.length; i++) {
  console.log(colors2[i]);
}

/////////////////////////////////////////////////////////////////////////////////////////
/*УСЛОВИЯ*/
/*
    -Позволяют осуществлять выбор в зависимост от ситуации;
    -else и else if дополнительны;
    
    -! - инверсия;
    -&&  - логическое "И";
    -|| - логическое "ИЛИ";
    
    -== - равно;
    -!= - не равно;
*/

// Условие выполнится.
if (1 == 1) {
  console.log("1=1");
}

// Условие не выполнится, но выполнится else if.
if (1 != 1) {
  console.log("1=1");
} else if (2 == 2) {
  console.log("2=2");
} else {
  console.log("Сработало else");
}

// Условия с переменными.
var Num_1 = 23;
var Num_2 = 23;
if (Num_1 > Num_2) {
  console.log(Num_1 + ">" + Num_2);
} else if (Num_1 == Num_2) {
  console.log(Num_1 + "=" + Num_2);
} else {
  console.log(Num_1 + "<" + Num_2);
}

// Работа с логикой.
var bool = true;
if ((!bool || Num_1 == 23) && Num_2 != 24) {
  console.log(bool);
}

// Оператор множественного выбора switch.
var rez = 3;
switch (rez) {
  case 1:
    //alert("rez = 1");
    break;
  case 2:
    //alert("rez = 2");
    break;
  case 3:
    //alert("rez = 3");
    break;
  default:
    //alert("Rez not find");
    break;
}

/////////////////////////////////////////////////////////////////////////////////////////
/*ФУНКЦИИ*/
/*
    -Это подпрограммы;
    -Зона видимости относится к JS также как и к C++ (локальные и глобальные);
*/

// Первая функция.
function write(word) {
  document.write(word);
}
write("Hello");
write("<br>");
write("World");
write("<br>");

// Функция с параметрами и возвратом.
function sum(a, b) {
  return a + b;
}
write(sum(5, 9)); // У функции в параметре функция.

/////////////////////////////////////////////////////////////////////////////////////////
/*ОБЪЕКТЫ*/
/*
    -Грубо говоря, классы, шаблоны для некоторых сущностей;
*/

// Создание объекта с методом и ключевым словом this.
var person = {
  firstName: "Brad",
  age: 45,
  children: ["Liza", "Perya"],
  address: {
    street: "555 Some st",
    city: "Boston",
    state: "MA",
  },
  NameAge: function () {
    return this.firstName + ", age is - " + this.age;
  },
};

// Обращение к объекту и методу.
console.log(person);
console.log(person.firstName);
console.log(person.address.city);
console.log(person.NameAge());

// Конструктор создания объектов.
var apple = new Object();
apple.color = "Green";
apple.shape = "Round";
apple.describe = function () {
  return "An apple is " + apple.color + " and " + apple.shape;
};
console.log(apple.color + apple.shape);
console.log(apple.describe());

// Функция как конструктор объекта.
function Fruit(color, shape) {
  this.color = color;
  this.shape = shape;
}
var melon = new Fruit("Yellow", "Round"); // Так легче.

/////////////////////////////////////////////////////////////////////////////////////////
/*СОБЫТИЯ*/
/*
    -К элементу можно обращаться по id, по классу или по имени самих объектов;
    -У разных объектов странички есть разные события;
*/

// Функции и кнопки.
function changeColor(newColor) {
  var element = document.getElementById("text"); // Получаем объект страницы по id.
  element.style.color = newColor; // Изменяем стиль объекта.
}

/////////////////////////////////////////////////////////////////////////////////////////
/*НЕБОЛЬШАЯ ПРАКТИКА (РАБОТА С ФОРМОЙ)*/
/*
    -Имя пользователя со странички;
    -Вообще берётся какой-либо элемент с формы и с ним осуществляется работа;
*/

function validateForm() {
  // Как массив: сначала берётся myForm, затем fname (поле);
  var element = document.forms["myForm"]["fname"].value;
  if (element == "") {
    alert("Не заполнено имя");
    return false; // Без return false submit перезагрузит страничку.
  }
}

if (prompt("Сколько вам лет?") >= 18) {
  console.log("Ура, тебе всё можно!");
} else {
  console.log("Нужно подождать!");
}
